-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-06-30 22:41:09
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `topic`
--

-- --------------------------------------------------------

--
-- 資料表結構 `secondhand_books`
--

CREATE TABLE `secondhand_books` (
  `book_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `book_title` varchar(255) NOT NULL,
  `img` varchar(50) NOT NULL,
  `author_name` varchar(100) NOT NULL,
  `price` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `description` text NOT NULL,
  `usage_duration` varchar(255) NOT NULL,
  `created_date` datetime NOT NULL,
  `revise_date` datetime NOT NULL,
  `status` varchar(20) NOT NULL DEFAULT '下架'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `secondhand_books`
--

INSERT INTO `secondhand_books` (`book_id`, `name`, `book_title`, `img`, `author_name`, `price`, `quantity`, `description`, `usage_duration`, `created_date`, `revise_date`, `status`) VALUES
(1, '文學與小說', '86的不存在的戰區', '649ecbd18e8ac.jpg', '安里アサト', 120, 1, '在步向毀滅的共和國，只有令人絕望的撤退作戰等著辛與蕾娜等人', '未拆封', '2023-06-30 20:34:25', '2023-06-30 20:34:25', '上架'),
(2, '教育與教學', 'Calculus 第11版 原文書', '649ecc6b9bb7b.jfif', 'Ron Larson, Bruce H. Edwards', 999, 10, '微積分超好用絕版書!', '五年以上', '2023-06-30 20:36:59', '2023-06-30 20:36:59', '上架'),
(3, '科學與科技', '挑戰PHP7／MySQL程式設計與超強專題特訓班(第四版)', '649eccbd6401c.jpg', '鄧文淵, 黃信溢, 文淵閣工作室', 250, 2, '', '三年內', '2023-06-30 20:38:21', '2023-06-30 20:38:21', '上架'),
(4, '科學與科技', '從零開始學Python程式設計', '649ecd1e099e6.jpg', '李馨', 299, 2, '學習一個程式語言，Python的簡單、明瞭能讓初學者快速上手。', '三年內', '2023-06-30 20:39:58', '2023-06-30 20:39:58', '上架'),
(5, '文學與小說', '不便利的便利店2', '649ecd7f92b0a.jpg', ' 金浩然', 349, 1, '人來去，心留駐，24小時亮著燈的地方，\r\n替疲憊的靈魂設下安慰的哨站', '未拆封', '2023-06-30 20:41:35', '2023-06-30 20:41:35', '上架'),
(6, '學術與專業', 'BREAD 3rd：世界級烘焙職人聖經', '649ecdcf4197b.jpg', ' Jeffrey Hamelman', 999, 1, 'Bread的高度｜「烘焙界的啟示」\r\n絕對值得珍藏的烘焙聖經', '未拆封', '2023-06-30 20:42:55', '2023-06-30 20:42:55', '上架'),
(7, '青年與兒童', '進擊的巨人 (34)', '649ece08dcc3f.jpg', ' 諫山創 ', 60, 1, '自由!', '一年內', '2023-06-30 20:43:52', '2023-06-30 20:43:52', '上架'),
(8, '藝術與設計', '如何欣賞藝術', '649ece52e77df.jpg', ' Carolyn Schlam', 500, 1, '這本書，是你認識藝術的入門通識課', '一年內', '2023-06-30 20:45:06', '2023-06-30 20:45:06', '上架'),
(9, '文學與小說', '丹寶與時間的金字塔', '649eced460651.jpg', '賽吉‧迪文', 50, 1, '她，叫丹寶，是上海證券交易所最年輕的女金牌交易員，所向披靡無往不利，直到……', '五年以上', '2023-06-30 20:47:16', '2023-06-30 20:47:16', '上架'),
(10, '青年與兒童', '名偵探柯南(102)', '649ecf4353bb6.jpg', ' 青山剛昌', 70, 1, '故事在沒有任何前兆下開始有了巨大的變動。', '未拆封', '2023-06-30 20:49:07', '2023-06-30 20:49:07', '上架'),
(11, '商業與經濟', '為什麼不能一直印鈔票？', '649ecfb5b7c02.jpg', ' The Bank of England ,Rupal Patel ,Jack Meaning', 399, 1, '比小說還好看的經濟學入門', '未拆封', '2023-06-30 20:51:01', '2023-06-30 20:51:01', '上架'),
(12, '生活與旅遊', '啊！這就是香港', '649ecfe82b46c.jpg', '空氣', 70, 5, '人氣博客空氣御駕親征，以一個普通台籍自遊行的眼光，看出個不一樣的香港', '五年以上', '2023-06-30 20:51:52', '2023-06-30 20:51:52', '上架'),
(13, '學術與專業', '原子習慣', '649ed05570b74.jpg', ' James Clear', 199, 12, '每天都進步1%，一年後，你會進步37倍', '三年內', '2023-06-30 20:53:41', '2023-06-30 20:53:41', '上架'),
(14, '商業與經濟', '逆思維', '649ed083c774f.jpg', ' Adam Grant', 399, 1, '想法轉個彎，人生路更寬！', '一年內', '2023-06-30 20:54:27', '2023-06-30 20:54:27', '上架'),
(15, '教育與教學', '陪伴孩子高效學習', '649ed0be5f7ba.jpg', ' 陳志恆', 399, 1, '解鎖3大關鍵，打造孩子高效學習力', '未拆封', '2023-06-30 20:55:26', '2023-06-30 20:55:26', '上架'),
(16, '商業與經濟', '晶片戰爭', '649ed100c9758.jpg', ' Chris Miller', 699, 1, '《金融時報》年度最佳商業書｜《經濟學人》年度最佳新書', '一年內', '2023-06-30 20:56:32', '2023-06-30 20:56:32', '上架'),
(17, '生活與旅遊', '跟著943搭台灣好行', '649ed182bdcfb.jpg', '943', 249, 1, '第一本台灣好行旅遊專書?', '一年內', '2023-06-30 20:58:42', '2023-06-30 20:58:42', '上架'),
(18, '文學與小說', '恐怖谷(新版)', '649ed1c8a6a88.jpg', '亞瑟·柯南·道爾', 179, 1, '腥風血雨的「恐怖谷」如何讓居民心驚膽戰、生不如死？', '三年內', '2023-06-30 20:59:52', '2023-06-30 20:59:52', '上架'),
(19, '商業與經濟', '與時間有約', '649ed212ba48c.jpg', ' Stephen R. Covey  ,A. Roger Merrill ,Rebecca R. Merrill ', 445, 4, '《紐約時報》《華爾街日報》《商業週刊》暢銷書', '一年內', '2023-06-30 21:01:06', '2023-06-30 21:01:06', '上架'),
(20, '商業與經濟', '說故事的領導', '649ed24e161b7.jpg', 'Paul Smith', 349, 2, '最有效的領導，從說個好故事開始', '一年內', '2023-06-30 21:02:06', '2023-06-30 21:02:06', '上架'),
(21, '學術與專業', '親愛的別怕，勇敢說YES', '649ed2d137aca.jpg', '鄒開蓮 ,盧智芳', 399, 3, '', '未拆封', '2023-06-30 21:04:17', '2023-06-30 21:04:17', '上架'),
(22, '文學與小說', '一個都不留：克莉絲蒂120誕辰紀念版', '649ed3e032206.jpg', '阿嘉莎．克莉絲蒂', 99, 2, '一個都不留，兇手是?', '五年以上', '2023-06-30 21:08:48', '2023-06-30 21:08:48', '上架'),
(23, '藝術與設計', '黃土水與他的時代', '649ed4480dfc2.jpg', ' 鈴木惠可', 199, 1, '「只要用血汗創作而成的作品還沒有被完全毀滅之前，我們是不會死的！」', '一年內', '2023-06-30 21:10:32', '2023-06-30 21:10:32', '上架'),
(24, '藝術與設計', '時計。複雜', '649ed48944e5d.jpg', '城邦國際名表', 49, 1, '複雜功能，是綜合懷錶誕生以來，歷經變化為腕錶的過程', '五年以上', '2023-06-30 21:11:37', '2023-06-30 21:11:37', '上架'),
(25, '歷史與人文', '一本書讀懂世界歷史', '649ed50a2b317.webp', '章世新', 99, 3, '', '三年內', '2023-06-30 21:13:46', '2023-06-30 21:13:46', '上架'),
(26, '歷史與人文', '被誤解的世界歷史 2019', '649ed568b1cb2.webp', ' 羅文興', 299, 2, '寫史書的人，不可能一字一句都說實話！', '三年內', '2023-06-30 21:15:20', '2023-06-30 21:15:20', '上架'),
(27, '其他', 'QUNing：初心版', '649ed62f053bf.webp', '吳函峮', 399, 9, '讚', '未拆封', '2023-06-30 21:18:39', '2023-06-30 21:18:39', '上架'),
(28, '藝術與設計', '開展．藝術商業特展大解密', '649ed6ab1c832.jpg', '林宜標', 399, 2, '藝文活動叫好不叫座？從木乃伊到航海王，每場展覽都是賭注！', '一年內', '2023-06-30 21:20:43', '2023-06-30 21:20:43', '上架'),
(29, '青年與兒童', '咒術迴戰 (10)', '649ed72488d12.jpg', '芥見 下々', 65, 2, '為了獲得能自由活動的身體', '一年內', '2023-06-30 21:22:44', '2023-06-30 21:22:44', '上架'),
(30, '青年與兒童', '死神 (71)', '649ed77a6b640.jpg', '久保带人', 70, 1, '繭利跟音夢──', '未拆封', '2023-06-30 21:24:10', '2023-06-30 21:24:10', '上架'),
(31, '科學與科技', '掌握Java SE11程式設計', '649ed82e3753c.jpg', '陳錦輝', 499, 1, '本書以細心規劃的進度，培養讀者在十六周的學習中', '一年內', '2023-06-30 21:27:10', '2023-06-30 21:27:10', '上架'),
(32, '科學與科技', 'KorGE遊戲開發 ', '649ed86c7879f.jpg', '張永欣', 499, 1, '教您用Kotlin語言設計跨平台遊戲', '一年內', '2023-06-30 21:28:12', '2023-06-30 21:28:12', '上架'),
(33, '生活與旅遊', '貓福珊迪的小旅行', '649ed89f25f97.jpg', 'ぢゅのJun', 299, 1, 'Mofusand貓福珊迪首部插畫繪集！', '一年內', '2023-06-30 21:29:03', '2023-06-30 21:29:03', '上架'),
(34, '生活與旅遊', 'BINBO時尚混英國', '649ed90901fdc.jpg', '呂雯歆', 149, 2, '', '五年以上', '2023-06-30 21:30:49', '2023-06-30 21:30:49', '上架'),
(35, '歷史與人文', '歷史獵人', '649ed971b3606.jpg', ' Nathan Raab ,Luke Barr ', 399, 1, '透過這本書，拉伯帶領讀者進行了一趟瘋狂的巡狩，並巧妙地打開了無數隱藏的歷史裂縫', '三年內', '2023-06-30 21:32:33', '2023-06-30 21:32:33', '上架'),
(36, '其他', '365天的塔羅魔法牌陣', '649ed9acd0e7f.jpg', ' 莎夏．葛蘭姆', 599, 1, '一年365天，天天為重要人生選擇提供導航～', '未拆封', '2023-06-30 21:33:32', '2023-06-30 21:33:32', '上架'),
(37, '教育與教學', '誦經與量子力學', '649eda04b7978.jpg', '張宏實', 399, 1, '50%50%', '一年內', '2023-06-30 21:35:00', '2023-06-30 21:35:00', '上架'),
(38, '教育與教學', '薛丁格的貓是不是挪威森林貓', '649eda6d342bc.jpg', ' 止湮', 99, 1, '執著年下助教攻 X 冷靜天才教授受', '一年內', '2023-06-30 21:36:45', '2023-06-30 21:36:45', '上架'),
(39, '其他', '能量自癒（最新版）', '649edab413f3c.jpg', ' Amy B. Scher', 149, 1, '美國哈佛醫學院教授推薦', '未拆封', '2023-06-30 21:37:56', '2023-06-30 21:37:56', '上架'),
(40, '青年與兒童', '蠟筆小新 (31)', '649edb2ee134d.jpg', ' 臼井儀人', 69, 1, '好笑', '五年以上', '2023-06-30 21:39:58', '2023-06-30 21:39:58', '上架');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `secondhand_books`
--
ALTER TABLE `secondhand_books`
  ADD PRIMARY KEY (`book_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `secondhand_books`
--
ALTER TABLE `secondhand_books`
  MODIFY `book_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
